package cn.zt.pos.db.obj;

/**
 * Created by SXK on 2017/7/26.
 */

public class PassingParame {
    @Override
    public String toString() {
        return "PassingParame{" +
                "s11='" + s11 + '\'' +
                ", s12='" + s12 + '\'' +
                ", s13='" + s13 + '\'' +
                ", s14='" + s14 + '\'' +
                ", s15='" + s15 + '\'' +
                ", s16='" + s16 + '\'' +
                ", s17='" + s17 + '\'' +
                ", s18='" + s18 + '\'' +
                ", s19='" + s19 + '\'' +
                ", s20='" + s20 + '\'' +
                ", s21='" + s21 + '\'' +
                ", s22='" + s22 + '\'' +
                ", s23='" + s23 + '\'' +
                ", s24='" + s24 + '\'' +
                ", s25='" + s25 + '\'' +
                ", s26='" + s26 + '\'' +
                ", s27='" + s27 + '\'' +
                '}';
    }

    /**超时时间 n2*/
    String s11;

    /**重试次数 n1*/
    String s12;
    /**是否支持小费 n1*/
    String s13;
    /**小费百分比 n2*/
    String s14;
    /**是否自动签到 <br/>n1 <br/>1—自动，0—不自动 默认为0-自动*/
    String s15;
    /**商户名称（中文简称或英文简称） an40*/
   public String s16;
    /**交易重发次数 n1  默认为3*/
    String s17;
    /**主密钥INDEX*/
    String s18;
    /**外卡消费及预授权完成是否支持DCC <br/>1位数字，1-支持，0-不支持，默认为1*/
    String s19;
    /**财务报销单笔最大金额 <br/> n12*/
    String s20;
    /**分期交易最低金额<br/> n12*/
    String s21;
    /**是否屏蔽卡号（见注一） <br/>n1 <br/> 1-屏蔽，0-不屏蔽，默认1-屏蔽*/
    String s22;
    /**是否打印故障报告单 <br/>n1 <br/>1-打印，0-不打印，默认0-不打印*/
    String s23;
    /**撤销类交易是否允许持卡人输入密码 <br/> n1 <br/> 1-输入；0-不输入。默认值为0：不输入*/
    String s24;
    /**终端默认交易参数 n1 <br/> 根据该参数的值确定在终端显示待机界面时刷卡可直接进入的默认交易。0：消费；1：预授权。默认值为0。*/
    String s25;
    /**是否大额分期交易 n1 <br/> 用于分期付款类交易中，控制是否大额分期，1—支持，0—不支持。默认值为0。*/
    String s26;
    /**支持的交易类型（及该交易是否支持手工输入卡号交易） b64 <br/> 8个字节（64位二进制表示）
     第一位控制是否支持交易： 1—支持，
     0—不支持
     第二位控制该交易是否支持手工输入卡号：1—支持，0—不支持*/
    public String s27;
}
